Tekla Open API Reference for Tekla Structures 2025
AnalysisModelIssue.TypeEnum Enumeration
 Issue type.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum TypeEnum
Public Enumeration TypeEnum
Members
Member name | Value | Description
CrossSectionValues | 1301 |  Cross section values issue.
ShortRigidLink | 1403 |  Short rigid link issue.
ShortMember | 1404 |  Short member issue.
ProfileOverride | 1405 |  Part profile override issue.
NearNodes | 1407 |  Near nodes issue.
RequiredRigidLinkDisabled | 1408 |  Required rigid link disabled issue.
TooCloseNodesForRigidLink | 1409 |  Too close nodes for rigid link issue.
MemberDirectionDifference | 1410 |  Member direction difference issue.
BarDirectionDifference | 1411 |  Bar direction difference issue.
BarNotConnected | 1412 |  Bar not connected issue.
BarOverlapping | 1413 |  Bar overlapping issue.
AreaNotConnected | 1414 |  Area not connected issue.
AreaNotPlanar | 1415 |  Area not planar issue.
LoadDistribution | 1501 |  Load distribution issue.
DuplicateLoad | 1502 |  Duplicate load issue.
LoadGroupNotInCombinations | 1503 |  Load group not in load combinations issue.
KmodeMustNePhysicalMember | 1416 |  Buckling kmode issue.
DesignParameterValueCount | 1417 |  Design parameter value count issue.
DesignParameterValue | 1419 |  Design parameter value issue.
See Also
Reference
Tekla.Structures.Analysis Namespace